Revit 2024 API
BuiltInFailures.GroupFailures.SomeMembersNotRestored Property
 Revit was not able to restore all of the requested group members. The members may depend on elements that are still excluded.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SomeMembersNotRestored { get; }
Visual Basic
Public Shared ReadOnly Property SomeMembersNotRestored As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SomeMembersNotRestored {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace